CREATE TABLE category(
	id int primary key,
	icecream_type VARCHAR ( 25 ) NOT NULL
);

create table icecreams(
	id int primary key,
	category_id int,
	name varchar(20) not null,
	descr varchar(100),
	info varchar(1000),
	weight float,
	time int,
	constraint category_in_icecreams foreign key(category_id) references category(id) on delete cascade 
);


create table turul(
	icecream_id int,
	turul varchar(17),
    constraint turul foreign key(icecream_id) references icecreams(id) on delete cascade 
);
create table imgs(
	icecream_id int,
	path varchar(60),
	constraint imgs foreign key(icecream_id) references icecreams(id) on delete cascade 
);
drop table imgs
drop table turul 
drop table icecreams
drop table category

INSERT INTO category
VALUES (1,'МӨНХ ТУНХ');

INSERT INTO category
VALUES (2,'ЖИМСТЭЙ ЗАЙРМАГ');

INSERT INTO category
VALUES (3,'ШОКОЛАДТАЙ ЗАЙРМАГ');

INSERT INTO category
VALUES (4,'MOCKTAIL');

INSERT INTO category
VALUES (5,'ААРЦТАЙ ЗАЙРМАГ');

INSERT INTO category
VALUES (6,'АЯГАТАЙ ЗАЙРМАГ');

INSERT INTO category
VALUES (7,'ЦӨЦГИЙТЭЙ ЗАЙРМАГ');

INSERT INTO category
VALUES (8,'ГЭР БҮЛИЙН ЗАЙРМАГ');

SELECT*
FROM CATEGORY

INSERT INTO icecreams
VALUES (1,1,'MUNH','Анх хараад л идэх хүсэл төрүүлнэ шоколад, цөцгийтэй MUNH','Хүүхэд багачуудад үлгэрээр дамжуулан шинэ санаа, шилдэг сургамжийг өгч, Монгол аж ахуйг танин мэдүүлж, хүүхдүүдийн хүмүүжилд эерэгээр нөлөөлж байгаа Мөнх Тунх хүүхэлдэйн кино гараад нэлээдгүй хугацаа өнгөрчээ. Эхний ангиасаа л хүүхдүүдийн сонирхлыг татаж шинэ дугаар бүрд өөр өөр санааг өгүүлж Монгол ардын үлгэрүүдийг орчин цагт хөрвүүлэн сонирхолтой содон байдлаар үзүүлдэг нь тухайн анимешний онцлог тал юм. Мөн бяцхан дүү нартаа хүүхэлдэйн киноноос гадна амин дэмээр баялаг шүүс болон Мөнх Тунх зайрмагийг хүргэж эхэллээ. Мөнх Тунх зайрмаг нь хоёр төрөлтэй бөгөөд бусад зайрмагаас Сахарын агууламж бага гэдгээрээ онцлог талтай юм. Хүүхэд бүр чихэрлэг зүйлд дуртай бөгөөд түүнийгээ ихээр идэх нь биед ямар нэгэн байдлаар сөрөг талтай байдаг бол Айсмарк компани Монголдоо анх удаа сахарын агууламж бага бүтээгдэхүүнийг бяцхан дүү нартаа зориулан үйлдвэрлэж эхэллээ.',65,6);
INSERT INTO icecreams
VALUES (2,1,'TUNH','Солонго шиг амттай гүзээлзгэнэ, цөцгийтэй сахарын агууламжгүй TUNH','Хүүхэд багачуудад үлгэрээр дамжуулан шинэ санаа, шилдэг сургамжийг өгч, Монгол аж ахуйг танин мэдүүлж, хүүхдүүдийн хүмүүжилд эерэгээр нөлөөлж байгаа Мөнх Тунх хүүхэлдэйн кино гараад нэлээдгүй хугацаа өнгөрчээ. Эхний ангиасаа л хүүхдүүдийн сонирхлыг татаж шинэ дугаар бүрд өөр өөр санааг өгүүлж Монгол ардын үлгэрүүдийг орчин цагт хөрвүүлэн сонирхолтой содон байдлаар үзүүлдэг нь тухайн анимешний онцлог тал юм. Мөн бяцхан дүү нартаа хүүхэлдэйн киноноос гадна амин дэмээр баялаг шүүс болон Мөнх Тунх зайрмагийг хүргэж эхэллээ. Мөнх Тунх зайрмаг нь хоёр төрөлтэй бөгөөд бусад зайрмагаас Сахарын агууламж бага гэдгээрээ онцлог талтай юм. Хүүхэд бүр чихэрлэг зүйлд дуртай бөгөөд түүнийгээ ихээр идэх нь биед ямар нэгэн байдлаар сөрөг талтай байдаг бол Айсмарк компани Монголдоо анх удаа сахарын агууламж бага бүтээгдэхүүнийг бяцхан дүү нартаа зориулан үйлдвэрлэж эхэллээ.',65,6);
INSERT INTO icecreams
VALUES (3,2,'IBERRY','Инээмсэглэл бэлэглэх амт, байгалийн зэрлэг жимс IBERRY.','Инээмсэглэл бэлэглэх байгалийн амт уриатай Iberry зайрмаг нь 2010 оноос эхлэн зах зээлд нэвтэрч хэрэглэгчдийнхээ таашаалыг хэдийнээ хүлээсэн бүтээгдэхэүүн юм. Монгол улсын нөхөн сэргээгддэг нөөц болох байгалийн зэрлэг жимс чацаргана, нэрс аньс жимсийг ашиглан энэхүү бүтээгдэхүүнийг үйлдвэрлэдэг. Худалдаанд гарсан цагаасаа эхлэн нийгэмд эрэлт хэрэгцээг бий болгосон уг зайрмаг 2019 онд сав баглаа боодлоо шинэчлэн өөрчилж аягатай төрлийн мөн нэмж гаргасан юм.',65,6);
INSERT INTO icecreams
VALUES (4,2,'MELLO','MELLO киви, гүзээлзгэнэ, черриний дур булаам амт.','Өөрийгөө хөглөе! Хөгжилтэй хөгтэй дүрсгүй дурсамжийг бүтээх шинэ сэргэх мэдрэмж түгээх #Mello зайрмаг',70,6);
INSERT INTO icecreams
VALUES (5,3,'VENUS','Хайр дурлалын амт VENUS','ХАЙР ДУРЛАЛЫН АМТ УРИАТАЙ АНХ ГАРЧ БАЙСАН ВЕНУС ЗАЙРМАГ ЗАЛУУЧУУДЫН ХАМГИЙН ИХ ИДЭХ ДУРТАЙ БҮТЭЭГДЭХҮҮНЭЭР ШАЛГАРСАН ЮМ. 2019 ОНД УГ ЗАЙРМАГТ ШИНЭЧЛЭЛТ ХИЙЖ “МЭДРЭМЖЭЭ ЧӨЛӨӨЛ” УРИАТАЙГААР ДАХИН ЗАЛУУЧУУДЫН ДУНД ТРЭНД БОЛЖ ТЭСРЭЛТ ХИЙЖ ЧАДСАН БҮТЭЭГДЭХҮҮН ЮМ. УГ ЗАЙРМАГ НЬ ШОКОЛАДТАЙ, ИРИСТЭЙ, САМАРТАЙ ГЭСЭН ҮНДСЭН ГУРВАН ТӨРӨЛТЭЙГӨӨР ХУДАЛДААЛАГДАЖ БАЙНА.',70,6);
INSERT INTO icecreams
VALUES (6,3,'ICEMARK','Төсөөллөөс ч илүү гүзээлзгэнэ, шоколадтай зайрмаг ICEMARK','2019 онышинэ бүтээгдэхүүн Айсмарк зайрмаг нь өөртөө итгэлтэй, өнгөлөг, шинийг санаачлагч хэн бүхэнд зориулсан бренд бүтээгдэхүүн юм. Монголдоо анх удаа шинэчлэгдсэн технилогоор 3D, 4D зайрмагийг үйлдвэрлэснээс гадна, аарцтай, чацарганатай, нэрстэй, крем брюле гээд хэрэглэгчдийн дуртай олон амтыг багтаасан уг зайрмаг нь үйлдвэрлэгдэн гарсан цагаасаа эхлэн нийгэмд хэдийнээ өөрийн байр сууриа олоод эхэлсэн юм.',70,6);
INSERT INTO icecreams
VALUES (7,4,'MOCKTAIL','Зөвхөн чамтай л энэ төгс амтыг хуваалцмаар MOCKTAIL','Мэргэжлийн бартендраас гаргасан жороор Mocktail Icecream 4 төрлийг санал болгож байна: - Cosmopolitan🍒 - Blue Ocean 🌊 - Mojito🍸 - Pina Colada🍍',65,6);
INSERT INTO icecreams
VALUES (8,5,'BAMBAR','Дархлаа дэмжигч аарцтай, чацарганатай, гүзээлзгэнэтэй BAMBAR','Монголын уламжлалт хүнс болох аарцыг орчин үеийн технологитой хослуулан гаргасан анхны бүтээгдэхүүн юм. Тус зайрмаг нь 2003 онд үйлдвэрлэгдэж эхэлснээс хойш өнөөдрийг хүртэл хэрэглэгчдийн таашаалт нийцсэн бүтээгдэхүүн хэвээр байсаар байна. Өнөөдрийн байдлаар Аарцтай, чацаргана аарцтай, тоглоомтой бамбар гэсэн үндсэн гурван төрөлтэйгээр худалдаалагддаг.',65,5);
INSERT INTO icecreams
VALUES (9,6,'TESO','Иристэй цөцгий аягатай TESO','The packing with easy-to-use cup and single-serve spoon is the main quality of Teso ice cream and the ice cream is enriched with perfect combination of caramel and cream. Caramel is the one of the main ingredient of this ice cream, which is imported from Russia. Teso is one of the most satisfying and enjoyable ice creams since its introduction to the market as a new member of our products.',65,6);
INSERT INTO icecreams
VALUES (10,6,'ELITE','Дур булаам амт, аягатай ELITE.','Тус зайрмаг нь цөцгийтэй зайрмаг бөгөөд нэмэлт орцонд нь самар жимс ордог болно. 570 граммийн савалгаатай тул та бүхэн гэр бүлээрээ болон олуулаа найз нөхдөөрөө идэхэд хамгийн тохиромжтой. Түүнээс гадна үйлчилгээний газрууд энэхүү зайрмагийг өөрсдийн дессертэнд хамгийн өргөнөөр ашиглан хэрэглэж байна.',550,6);
INSERT INTO icecreams
VALUES (11,6,'MOCHA','Ногоон цайтай зайрмаг таныг таргалуулахгүй',NULL,65,6);
INSERT INTO icecreams
VALUES (12,6,'YOGURT ICECREAM','Эрүүл мэндийн зайрмаг YOGURT ICECREAM',NULL,65,6);
INSERT INTO icecreams
VALUES (13,7,'ALYASKA','Амтат цөцгий эрүүл амттан ALYASKA','ХЭРЭГЛЭГЧДИЙН ДУНД ХЭЗЭЭНИЙ ӨӨРИЙН БАЙР СУУРИЙГ ОЛЖ ҮНЭНЧ ХЭРЭГЛЭГЧДЭЭ ТАТАЖ ЧАДСАН АЛЯСКА ЗАЙРМАГ НЬ ЦЭВЭР ЦӨЦГИЙГ АШИГЛАН ХИЙДЭГ БӨГӨӨД ЦӨЦГИЙТЭЙ, ШОКОЛАДТАЙ , ЖИМСТЭЙ ГЭСЭН ҮНДСЭН ГУРВАН ТӨРӨЛТЭЙ ЮМ. АМАНД ОРООД Л ХАЙЛАН УРСАЖ, ЗӨӨЛӨН АМТЫГ МЭДРЭХ ДУРТАЙ ХЭН БҮХЭНД АЛЯСКА ЗАЙРМАГИЙГ ЗОРИУЛАН ҮЙЛДВЭРЛЭЖ БАЙНА.',65,6);
INSERT INTO icecreams
VALUES (14,7,'STANDART','Уруул дурлам аз жаргалын амт STANDART',NULL,65,6);
INSERT INTO icecreams
VALUES (15,7,'PLOMBIR','Цөцгий, самар, ирсисний төгс хослол PLOMBIR','Plombir ice cream is for everyone who enjoys a variety of taste such as creamy nuts, creamy raisin and chocolate nuts. Our customers satisfy with this ice cream which has own unique taste in the ice cream market.',70,6);
INSERT INTO icecreams
VALUES (16,8,'IMPERIA CAKE ICECREAM','Хайртдаа өгөх хамгийн гоё бэлэг IMPERIA зайрмаган бялуу.','Монголд хамгийн анх удаа Айсмарк компани орос технологиор Монголд анх удаа тортон зайрмаг үйлдвэрлэж 2016 онд зах зээлд нэвтрүүлсэн. Тус зайрмаг нь гэр бүл хамт олон найз нөхөдтэйгээ хамт олуулаа идэхэд хамгийн тохиромжтой бөгөөд сав баглаа боодлын хувьд ч хүнд бэлэглэхэд нэн тохирох бүтээгдэхүүн юм. Худалдаанд гарцсан цагаас нь хойш хэрэглэгчид өнөөдрийг хүртэл төрсөн өдөр шинэ жил гэх мэт баярын ширээнд ашиглах зорилгоор хамгийн ихээр худалдан авсаар байна. Тус зайрмаг нь 850 граммтайгаар савлагдсан.',850,6);
INSERT INTO icecreams
VALUES (17,8,'MINI SHOCK','Аз жаргалын амтаа хамтдаа хуваалцах хамгийн шилдэг амттан бол MINI SHOCK','Нэг дор дөрвөн төрлийн амттанг цуглуулсан Мини шок зайрмаг нь гэр бүлээрээ болон найз нөхдөөрөө идэхэд хамгийн тохиромжтой бүтээгдэхүүн юм. Хэн нэгэнд баярын бэлэг болгож өгөх, хайр сэтгэлээ илэрхийлэх, найз нөхдийн нандин холбоогоо бататгаж аз жаргалын амтаа хамтдаа хуваалцах хамгийн шилдэг амттан бол Мини шок зайрмаг юм.',420,6);
INSERT INTO icecreams
VALUES (18,8,'ELITE','Гэр бүлээрээ идэхэд хамгийн тохиромжтой ELITE','Тус зайрмаг нь цөцгийтэй зайрмаг бөгөөд нэмэлт орцонд нь самар жимс ордог болно. 570 граммийн савалгаатай тул та бүхэн гэр бүлээрээ болон олуулаа найз нөхдөөрөө идэхэд хамгийн тохиромжтой. Түүнээс гадна үйлчилгээний газрууд энэхүү зайрмагийг өөрсдийн дессертэнд хамгийн өргөнөөр ашиглан хэрэглэж байна.',550,6);



